# Notebook 2 - Data Cleaning

##### Alessandro DeChellis
##### Data Set: salaries.csv 
##### Data Set: players.csv

## Introduction

In this notebook, we will take in the data from the previous notebook, <b> Book1 - Data Collection </b>. We will transform the data and marge the two datasets into one workable set ready for our modelling. 

The ideal data frame with have a team's season as the rows with the columns being season, year, salary cap, 5 playoff rounds for dummy variables and individual player salaries for players 1-20.

There was a large amount of manual work done in this notebook in order to get the data where we wanted it to be, as it was not readily available online in an easier way.

*** <b> DISCLAIMER: DO NOT RUN THIS NOTEBOOK, IT WILL AFFECT FUTURE NOTEBOOKS</b> ***

In [5]:
# Standard imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

### Read in the data

We first read in the salaries csv from our previous notebook

In [67]:
# Read in the csv

salaries = pd.read_csv('data/salaries.csv')

In [533]:
# Read in the salaries csv
salaries.head()
salaries.isna().sum()

year        0
name        0
position    0
cap_hit     0
dtype: int64

We then read in the players csv into a dataframe

In [60]:
# Read in the csv
players = pd.read_csv('data/players.csv')

### Changing Value Types

We need to change the value types in the salaries dataframe

In [68]:
# Change the cap hit to int
salaries['cap_hit'] = salaries['cap_hit'].astype(int)
# Change the name to a string
salaries['name'] = salaries['name'].astype(str)
# Change the position to a string
salaries['position'] = salaries['position'].astype(str)
# Check that this worked
salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18042 entries, 0 to 18041
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   year      18042 non-null  int64
 1   name      18042 non-null  object
 2   position  18042 non-null  object
 3   cap_hit   18042 non-null  int64
dtypes: int64(2), object(2)
memory usage: 563.9+ KB

### Ensuring the Names Line Up

During intital investigation of the dataframes, it became very clear that there were lots of issues with the names in the two dataframes that would have to be changed before merging the dataframes. 

We needed to replace all the accent types on the letters, all of the spaces, change everything to lower case and get rid of the '(C)' on captains for each team. This ended up being a very manual process, as we needed to search both csvs to find what the issues were.

In [100]:
# Replace all undesirable letters

players['name'] = players['name'].str.replace((' \(C\)'), '')
salaries['name'] = salaries['name'].str.replace(('é'), 'e')
players['name'] = players['name'].str.replace(('é'), 'e')
salaries['name'] = salaries['name'].str.replace(('á'), 'a')
players['name'] = players['name'].str.replace(('á'), 'a')
salaries['name'] = salaries['name'].str.replace(('í'), 'i')
players['name'] = players['name'].str.replace(('í'), 'i')
salaries['name'] = salaries['name'].str.replace(('ä'), 'a')
players['name'] = players['name'].str.replace(('ä'), 'a')
salaries['name'] = salaries['name'].str.replace(('\''), '')
players['name'] = players['name'].str.replace(('\''), '')
salaries['name'] = salaries['name'].str.replace(('ö'), 'o')
players['name'] = players['name'].str.replace(('ö'), 'o')
salaries['name'] = salaries['name'].str.replace(('.'), '')
players['name'] = players['name'].str.replace(('.'), '')
salaries['name'] = salaries['name'].str.replace(('î'), 'i')
players['name'] = players['name'].str.replace(('î'), 'i')
salaries['name'] = salaries['name'].str.replace((' '), '')
salaries['name'] = salaries['name'].str.replace(('-'), '')
players['name'] = players['name'].str.replace((' '), '')
players['name'] = players['name'].str.replace(('-'), '')
salaries['name'] = salaries['name'].str.replace('[.]', '')
salaries['name'] = salaries['name'].str.replace('[0-9]', '')
salaries['name'] = salaries['name'].str.replace("'", '')
salaries['name'] = salaries['name'].str.replace("'", '')
salaries['name'] = salaries['name'].apply(lambda x: str(x).lower())
players['name'] = players['name'].apply(lambda x: str(x).lower())
salaries['name'] = salaries['name'].str.replace('/ /g','')
salaries['name'] = salaries['name'].str.replace('/ /g','')
salaries['name'] = salaries['name'].str.rstrip()
salaries['name'] = salaries['name'].str.rstrip()
salaries['name'] = salaries['name'].str.replace('ç','c')
salaries['name'] = salaries['name'].str.replace('ç','c')
salaries['name'] = salaries['name'].str.replace('è','e')
salaries['name'] = salaries['name'].str.replace('è','e')
salaries['name'] = salaries['name'].str.replace('å','a')
salaries['name'] = salaries['name'].str.replace('å','a')
salaries['name'] = salaries['name'].str.replace('ü','u')
salaries['name'] = salaries['name'].str.replace('ü','u')
salaries['name'] = salaries['name'].str.replace('ë','e')
salaries['name'] = salaries['name'].str.replace('ë','e')

<ipython-input-100-e6913df7bb36>:1: FutureWarning: The default value of regex will change from True to False in a future version.
  players['name'] = players['name'].str.replace((' \(C\)'), '')
<ipython-input-100-e6913df7bb36>:14: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  salaries['name'] = salaries['name'].str.replace(('.'), '')
<ipython-input-100-e6913df7bb36>:15: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  players['name'] = players['name'].str.replace(('.'), '')
<ipython-input-100-e6913df7bb36>:22: FutureWarning: The default value of regex will change from True to False in a future version.
  salaries['name'] = salaries['name'].str.replace('[.]', '')
<ipython-input-100-e6913df7bb36>:23: FutureWarning: The default value of regex will change from True to False in a future version.
  salaries['name'] = salaries['name'].str.replace('[0-9]', '')

In [291]:
# This function was used to trim all whitespace

def trim_all_columns(df):
    """
    Trim whitespace from ends of each value across all series in dataframe
    """
    trim_strings = lambda x: x.strip() if isinstance(x, str) else x
    return df.applymap(trim_strings)

salaries = trim_all_columns(salaries)
players = trim_all_columns(players)

We then checked that this worked

In [538]:
# Check that the salaries dataframe changed
salaries.head()

   year            name position   cap_hit
0  2021   connormcdavid        C  12500000
1  2021   artemipanarin       LW  11642857
2  2021  austonmatthews        C  11640250
3  2021    erikkarlsson       RD  11500000
4  2021     johntavares        C  11000000

In [539]:
# Do the same for players
players.head()

   Unnamed: 0  year          name team
0           0  2007    craigadams  CAR
1           1  2007    kevynadams  CAR
2           2  2007   keithaucoin  CAR
3           3  2007  antonbabchuk  CAR
4           4  2007     ryanbayda  CAR

### Further Manual Cleaning

After further analysis, it was noticed that there was still a large issue with names being different in the two data frames (ie. Rob and Robert, Dave and David). So the below code was run a multitude of times with different names until the data was sufficient to join.

In [ ]:
condition = players['name'] == 'davemoss'
players.loc[condition, 'name'] = 'davidmoss'

### Joining Dataframes

Now that the data is clean, we can use the `merge` function to join the two dataframes.

In [ ]:
## Merge on name and year
new_df = players.merge(salaries, how='left', on=['name','year'] )

It was realized that there were too many unknown salaries before 2012, so all years from 2007-2011 were dropped.

In [ ]:
# Drop all years before 2012

good = new_df.loc[new_df['year'] != 2007]
good = good.loc[new_df['year'] != 2008]
good = good.loc[new_df['year'] != 2009]
good = good.loc[new_df['year'] != 2010]
good = good.loc[new_df['year'] != 2011]

We then saved this to a new csv to save our progress.

In [ ]:
good.to_csv('data/clean_players.csv')

### Restructuring

Now that we have clean data, we can begin to restructure the data in order to have it ready for modelling

In [ ]:
# Read in the csv
clean = pd.read_csv('data/clean_players.csv')

We then properly ordered the salaries by team, year and cap_hit. We also decided to drop the unnamed axis column and the name column, as the player's name is irrelevant to us in this analysis.

In [616]:
# sort the values and drop the two irrelevant columns

clean = clean.sort_values(by=['team', 'year', 'position', 'cap_hit'], ascending=False)
clean.head()
clean2 = clean.drop(['name'], axis=1)
clean2 = clean2.drop(['Unnamed: 0'], axis=1)

We then check that this worked.

In [10]:
# Check our work
clean2.head()

   year team position    cap_hit
0  2021  WPG        G  6166666.0
1  2021  WPG        G  1500000.0
2  2021  WPG        F  8250000.0
3  2021  WPG        F  7142857.0
4  2021  WPG        F  6750000.0

It was also determined that we can drop the position column.

In [11]:
# Drop the position column
clean3 = clean2.drop(['position'], axis=1)

In order to get the P1-P25 values that we needed to pivot the table on, we saved the file as a csv and manual imputed P1-P25 for each team.

In [ ]:
# Save to csv
clean3.to_csv('data/cleanest.csv')

We then read this data back into the notebook after the P values were added and dropped the NaN values.

In [219]:
# read in the csv and drop the NaN values

clean4 = clean4.dropna()
clean4.head()

   year team Player    cap_hit
0  2021  WPG     P1  8250000.0
1  2021  WPG     P2  7142857.0
2  2021  WPG     P3  6750000.0
3  2021  WPG     P4  6500000.0
4  2021  WPG     P5  6250000.0

## Pivoting the Table

After the manual work was done, it was realized that in order to have the columns ordered in the way we wanted, the 'P' in P1-P25 would have to be dropped. 

We then pivoted the table to transform the columns into rows

In [244]:
# Drop P 
clean4['Player'] = clean4['Player'].str.replace(('P'), '')
clean4['Player'] = clean4['Player'].astype(int)
# Pivot the dataframe
clean5 = clean4.pivot(index=['team','year'], columns='Player', values='cap_hit')
pd.set_option("display.max_columns", None)
# Save to a csv
clean5.to_csv('data/nhl_data.csv', index=True)

### Manual Imputation of Results

Again it was realized that it was much easier to manually add in the results for each team's season in the csv. There were 5 columns added as:

- R1: Team made the playoffs
- R2: Team made the second round
- R3: Team made the third round
- R4: Team made the Stanley Cup Finals
- WC: Team won the Stanley Cup

The values were either 1 or 0 depending on positive or negative, respectively.

### Adding Salary Cap

To add the salary cap for each season, we read the csv back into the notebook and created a column called `salary cap`

In [279]:
# Read the csv back in
nhl_data = pd.read_csv('data/nhl_data.csv')

In [280]:
# Create the salary cap column
nhl_data['salary cap'] = 0

In [281]:
# Check that it worked
nhl_data.head()

,team,year,R1,R2,R3,R4,WC,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,salary cap
0,ARI,2012,1.0,1.0,1.0,NaN,NaN,5250000.0,5000000.0,4550000.0,3750000.0,3000000.0,3000000.0,2975000.0,2750000.0,2000000.0,1850000.0,1800000.0,1800000.0,1750000.0,1400000.0,1325000.0,1250000.0,1100000.0,1050000.0,900000.0,900000.0,900000.0,850000.0,625000.0,625000.0,612500.0,0
1,ARI,2013,NaN,NaN,NaN,NaN,NaN,5300000.0,5250000.0,4000000.0,3750000.0,3500000.0,3100000.0,3000000.0,2975000.0,2750000.0,2000000.0,1850000.0,1800000.0,1750000.0,1325000.0,1250000.0,1100000.0,900000.0,900000.0,853333.0,850500.0,803250.0,737500.0,675000.0,650000.0,650000.0,0
2,ARI,2014,NaN,NaN,NaN,NaN,NaN,5666667.0,5500000.0,5500000.0,5300000.0,5250000.0,4500000.0,4000000.0,3750000.0,3100000.0,3000000.0,2975000.0,2750000.0,2550000.0,2500000.0,1187500.0,1150000.0,875000.0,870000.0,863333.0,853333.0,840000.0,830833.0,785000.0,750000.0,737500.0,0
3,ARI,2015,NaN,NaN,NaN,NaN,NaN,5666667.0,5500000.0,5300000.0,5250000.0,4800000.0,4500000.0,4000000.0,3750000.0,3100000.0,2550000.0,2500000.0,1187500.0,1150000.0,1150000.0,1116667.0,925000.0,894167.0,875000.0,863333.0,853333.0,850500.0,840000.0,830833.0,800000.0,667500.0,0
4,ARI,2016,NaN,NaN,NaN,NaN,NaN,5666667.0,5500000.0,5300000.0,3750000.0,3750000.0,3500000.0,3500000.0,3200000.0,3100000.0,3000000.0,2083333.0,1750000.0,1150000.0,1116667.0,1040000.0,925000.0,925000.0,925000.0,875000.0,875000.0,863333.0,863333.0,853333.0,850500.0,772500.0,0

The salary cap was then added for each year individually. The info came from www.capfriendly.com

In [285]:
# Add in the salary cap
condition = (nhl_data['year'] == 2012)
nhl_data.loc[condition, 'salary cap'] = 64300000
condition = (nhl_data['year'] == 2013)
nhl_data.loc[condition, 'salary cap'] = 64300000
condition = (nhl_data['year'] == 2014)
nhl_data.loc[condition, 'salary cap'] = 64300000
condition = (nhl_data['year'] == 2015)
nhl_data.loc[condition, 'salary cap'] = 69000000
condition = (nhl_data['year'] == 2016)
nhl_data.loc[condition, 'salary cap'] = 71400000
condition = (nhl_data['year'] == 2017)
nhl_data.loc[condition, 'salary cap'] = 73000000
condition = (nhl_data['year'] == 2018)
nhl_data.loc[condition, 'salary cap'] = 75000000
condition = (nhl_data['year'] == 2019)
nhl_data.loc[condition, 'salary cap'] = 79500000
condition = (nhl_data['year'] == 2020)
nhl_data.loc[condition, 'salary cap'] = 81500000
condition = (nhl_data['year'] == 2021)
nhl_data.loc[condition, 'salary cap'] = 81500000

We can now save this final table to a csv and move on to the EDA and visualization Notebook.

In [296]:
# Save to csv
nhl_data.to_csv('nhl_data.csv')

## Conclusion

In this notebook, we formatted our data into a dataset fit for our EDA and visualization. There was much more manual work than we would hope for, but it was necessary to get to our final result. Our data is now exactly how we outlined in the wireframe and we can begin to look for meaningful results. 

This process turned out to be quite labour intensive, but was worth it to get the ideal dataset. 

We can now begin our EDA and Visualization in the next notebook: <b> Book3 - EDA and Visualization </b>